def greet():
    print("Приветствуем вас в приложении")
    print("-----------------------------")
    print("------- Учёт финансов -------")
    print("-----------------------------")
    print("        Режимы работы:       ")
    print("-----------------------------")
    print("   1.  Добавить зачисление   ")
    print("   2.  Добавить трату        ")
    print("   3.  Получить статистику   ")
    print("   4.  Выйти из программы    ")
    print("-----------------------------")
    print(" Формат ввода даты: YY-MM-DD ")
def greet():
    print("Приветствуем вас в приложении")
    print("-----------------------------")
    print("------- Учёт финансов -------")
    print("-----------------------------")
    print("        Режимы работы:       ")
    print("-----------------------------")
    print("   1.  Добавить зачисление   ")
    print("   2.  Добавить трату        ")
    print("   3.  Получить статистику   ")
    print("   4.  Выйти из программы    ")
    print("-----------------------------")
    print(" Формат ввода даты: YY-MM-DD ")

def ask_mode():
    print("-----------------------------")
    return input("    Выберите режим работы:   ")

def wrong():
    print("-----------------------------")
    print("Вы ввели некорректный режим")