### 1. Техническое задание
### Название приложения: **Учет финансов**
### Функционал:
1.# Приложение для одного пользователя
2.# В приложение можно заносить поступления и траты финансов
3. #Можно задавать категорию
4. #Можно задавать конкретную дату
5. #Можно получать статистику за определенный промежуток времени
6. #В статистике отображаются траты и поступления по категориям
### 2. Какие библиотекии используем?

import datetime as dt
from collections import defaultdict
import json
import os.path