n = [1,2,3,4,5,6,7]
print (n)
n = [1,2,"name",34.5]
print (n)
n = ["Платон", "Яков","Gnfktvtq",]
print (n)
#(это простой список со списком внутри)создаём список имён:
n.append("Валерка")
print (n)# добавили 1 элемент в список.
n. pop()
print(n)# удаляет последний элемент списка
m = [1,23,45,22,2,3,4,44]
m.sort()# метод сортировки от малого к большему
print (m)
m.sort(reverse= True)# метод сортировки отбольшего к меньшему
print (m)
m[1] = "u"# изменяет элемент списка в строке.
print(m)
l = ["ghjkk","hygg","iiiii"]
l.sort()# эта же функция сортировки дествует и на строчное написание
print (l)
