#Пример вычисления метрики из набора списков. Столбцы в каждой строке:
#- дата
#- номер счетчика
#- количество визитов

#Найдем среднее количество визитов по нашим данным
api_response = [
    ['2017-12-26', '777', 184],
    ['2017-12-27', '111', 146],
    ['2017-12-28', '777', 98],
    ['2017-12-29', '777', 206],
    ['2017-12-30', '111', 254],
    ['2017-12-31', '777', 89],
    ['2018-01-01', '111', 54],
    ['2018-01-02', '777', 68],
    ['2018-01-03', '777', 74],
    ['2018-01-04', '111', 89],
    ['2018-01-05', '777', 104],
    ['2018-01-06', '777', 99],
    ['2018-01-07', '777', 145],
    ['2018-01-08', '111', 184],
]
sum_ = 0
for element in api_response:
    sum_ += element[2]

print(round(sum_ / len(api_response), 2))