geo_logs = [
    {'visit1': ['Москва', 'Россия']},
    {'visit2': ['Дели', 'Индия']},
    {'visit3': ['Владимир', 'Россия']},
    {'visit4': ['Лиссабон', 'Португалия']},
    {'visit5': ['Париж', 'Франция']},
    {'visit6': ['Тула', 'Россия']},
    {'visit7': ['Курск', 'Россия']},
    {'visit8': ['Архангельск', 'Россия']}
]
for log in geo_logs:
    for el in log.values():
        if 'Россия' not in el:
            geo_logs.remove(log)

print(geo_logs)#  и здесь ошибка - воспроизводится весь саписок,а нам нужна лишь Россия!